# Щоб Python не бачив цей слеш в Test1 (\) можна 1) поставити ще один: "c:install\\nython" або 2) написати "r" на початку: r""c:install\nython"

Test1 = "c:install\nython"
Test2 = "c:install\\nython"
Test3 = r"c:install\nython"

print (Test1)
print ("--------------------")
print (Test2)
print ("--------------------")
print (Test3)
print ("--------------------")

# В функції print можна виводити одразу декілька елементів через кому

a = 5
b = "Privet"

print ("123", "456", a, b)
print ("--------------------")

# Щоб вставити якийсь елемент пишемо так

Name = "Andrew"

print ("Hi, my name is", Name)
print ("--------------------")

# Або через "+"

print ("Hi, my name is " + "Andrew") # ЗАУВАЖЕННЯ: якщо робити через "+", то роби пробіл в місці "розриву"
print ("--------------------")

# Функція input (взаємодія з користувачем)

x = float(input("x = ")) # Всередину дужок пишемо текст для описання того, що вводишь (запусти щоб зрозуміти)
y = float(input("y = "))

print ("Result =", x + y)
print ("--------------------")

# Приклад

number1 = 1
number2 = 2

print ("m =", number1, "n =", number2)
print ("--------------------")

# f строки
# Запишемо попередній приклад через f строку

print(f"m = {number1}, n = {number2}") # Тобто в f строках можна вставляти елементи за допомогою "{}"
print ("--------------------")

# Напишемо функцію
# Для написання використовуємо def "назва функції" (аргументи, які ми передаємо): і знизу код функції

def sum (x, y, z, m):
    result = x + y + z + m # Змінна result дорівює сумі всіх змінних
    return result # Щоб повернути значення функції використовуємо return

# Виводимо результат

print ("Добуток =", sum(1, 2, 3, 4)) # Всередені print пишемо назву функції sum і в дужках передаємо аргументи sum (1, 2, 3, 4) або sum (x = 1, y = 2, z = 3, m = 4)
print ("--------------------")