"""1. Написати функцію, яка може приймати скільки завгодно позиційних аргументів та повертає кількість
отриманих аргументів."""

def func(*args):
    count = 0

    for i in args:
        count += 1
    return count

"""2. Написати функцію, яка за наявності ключового аргументу shevchenko виводить кілька рядків з віршів
Т.Г. Шевченка, за наявності ключового аргументу algebra виводить формулювання основної теореми
алгебри, за наявності ключового аргументу dm виводить означення симетричного відношення."""

def solution(**kwargs):
    if 'shevchenko' in kwargs:
        print('Встала весна,\nчорну землю Сонну розбудила,\nУквітчала її рястом,\nБарвінком укрила;')
    if 'algebra' in kwargs:
        print('Основна теорема алгебри')
    if 'dm' in kwargs:
        print('Означення симетричного відношення')